/*Информационная система «Бухгалтерия 1Ц» рассчитывает начисление заработной
платы работников некоторого предприятия. О каждом начислении зарплаты данные
представлены следующим набором: уникальный идентификатор idP (порядковый номер начисления), 
табельный номер работника, месяц, год, начисленная сумма. 
Реализовать систему хранения данных о зарплате в виде бинарного дерева поиска, 
ключом которого является idP. Обеспечить: 
а) добавление нового начисления с автоматическим присваиванием idP;
б) поиск начисления зарплаты по idP;
в) поиск всех начислений зарплаты определённого работника;
г) выдачу всего списка начислений, упорядоченных по idP;
д) удаление начисления по ключу;
е) построение другого бинарного дерева поиска, ключом которого является табельный номер, 
и выдача списка начисления, упорядоченного по табельным номерам.*/

#include <iostream>

int main()
{
    
}
